In [7]:
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [68]:
# Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:
#Check the number of rentals for each customer for May

connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)

querry1 = "SELECT customer_id, count(rental_id) as rentals_may FROM sakila.rentals_june GROUP BY customer_id;"

data_may = pd.read_sql_query(querry1, engine)
data_may.head()

   customer_id  rentals_may
0          416            5
1          516            6
2          239            5
3          285            3
4          310            6

In [76]:
# Check the number of rentals for each customer for June

querry2 = "SELECT customer_id, count(rental_id) as rentals_june FROM sakila.rentals_june GROUP BY customer_id;"

data_june = pd.read_sql_query(querry2, engine)
data_june.head(20)

    customer_id  rentals_june
0           416             5
1           516             6
2           239             5
3           285             3
4           310             6
5           592             5
6            49             5
7           264             4
8            46             7
9           323             3
10          481             4
11          139             4
12          595             2
13          284             3
14          306             2
15          191             6
16           95             4
17          197             8
18          512             3
19          210             2

In [28]:
data_may[data_may['customer_id'] == 285].number_of_rentals.values[0]

3

In [34]:
# Write a function that checks if customer borrowed more or less books in the month of June as compared to May.

def most_borrows_books(i):
    if i in data_may['customer_id'].tolist() and i not in data_june['customer_id'].tolist():
        return 'Customer didn\'t borrow books in June'
    elif i in data_june['customer_id'].tolist() and i not in data_may['customer_id'].tolist():
        return 'Customer didn\'t borrow books in May'
    elif i not in data_june['customer_id'].tolist() and i not in data_may['customer_id'].tolist():
        return 'Customer doesn\'t exist'
    customer_may = data_may[data_may['customer_id'] == i].number_of_rentals.values[0]
    customer_june = data_june[data_june['customer_id'] == i].number_of_rentals.values[0]

    if customer_may > customer_june:
        return 'Customer borrowed {} books in May'.format(customer_may - customer_june)
    elif customer_may < customer_june:
        return 'Customer borrowed {} books in June'.format(customer_june - customer_may)
    else:
        return 'Customer borrowed the same number of books, {}, in May and June'.format(customer_june)
most_borrows_books(210)

'Customer borrowed the same number of books, 2, in May and June'

In [39]:
a = data_may.number_of_rentals.values[4]
print(a)

6

In [77]:
data_may = data_may.set_index("customer_id")

KeyError: "None of ['customer_id'] are in the columns"

In [78]:
data_june = data_june.set_index("customer_id")

In [79]:
data_may.head()

             rentals_may
customer_id
416                    5
516                    6
239                    5
285                    3
310                    6

In [81]:
data_new = pd.concat([data_june,data_may], axis=1)

In [82]:
data_new.head(100)

             rentals_june  rentals_may
customer_id
416                     5            5
516                     6            6
239                     5            5
285                     3            3
310                     6            6
...                   ...          ...
570                     7            7
586                     2            2
236                     8            8
540                     5            5
439                     6            6

[100 rows x 2 columns]

In [83]:
data_new.fillna(0)

             rentals_june  rentals_may
customer_id
416                     5            5
516                     6            6
239                     5            5
285                     3            3
310                     6            6
...                   ...          ...
412                     1            1
335                     1            1
226                     2            2
22                      1            1
126                     1            1

[590 rows x 2 columns]

In [84]:
i=416
rowData = data_new.loc[ i , :][1]
print(rowData)

5

In [86]:
def x(i):
    subs = data_new.loc[i,:][0] - data_new.loc[i,:][1]
    if subs > 0:
        return 'Customer borrowed {} books in May'.format(subs)
    elif subs < 0:
        return 'Customer borrowed {} books in June'.format(-(subs))
    else:
        return 'Customer borrowed the same books, {}, in both monts'.format(data_new.loc[i,:][1])
x(416)

'Customer borrowed the same books, 5, in both monts'